app/controllers/store_controller.rb

  def add_to_cart
    begin
      product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 953125641)

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2009-02-16 01:15:45', 953125641, 1, 996332878, 1395, '2009-02-16 01:15:45')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('demi', 'somewhere', '2009-02-16 01:15:45', '2009-02-16 01:15:45', 'cc', 'demi@demi.com')