app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('demi', 'testsalt', '2009-02-16 02:29:05', '2009-02-16 02:29:05', '7c71e6aea49e191d0bd32e7353dba77224ffe4ac')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
UPDATE "users" SET "updated_at" = '2009-02-16 02:33:43', "salt" = '197647500.542359200379697', "hashed_password" = '5da36c0cd33fd5a5a31cb8569effdb417e4813ee' WHERE "id" = 953125641

  def destroy
    @user = User.find(params[:id])
    begin
      flash[:notice] = "User #{@user.name} deleted"
      @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
DELETE FROM "users" WHERE "id" = 953125641